## cloud_asset_inventory
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                   NAME                   |
|----------|------------------------------------------|
| recreate | `aws_ecs_task_definition.cloudquery`     |
| add      | `aws_ssm_parameter.cloudquery_api_key`   |
| update   | `aws_cloudwatch_event_rule.cloudquery`   |
|          | `aws_cloudwatch_event_target.cloudquery` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cloudquery_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cloudquery_container_definition"  {
      ~ id       = "4b17515a1e741a64e99f21c0e241e6181fc91e7c2ff323ac8c2874dc5e52a452" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "CQ_S3_BUCKET"
                          - value = "security-tools-794722365809-cloudquery-results"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cloudquery:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cloudquery"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cloudquery-task"
                        }
                    }
                  - name             = "cloudquery"
                  - portMappings     = []
                  - secrets          = []
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                    name             = "${CLOUDQUERY_SERVICE_NAME}"
                  ~ secrets          = [
                      + {
                          + name      = "CLOUDQUERY_API_KEY"
                          + valueFrom = "${CLOUDQUERY_API_KEY_SSM_PARAMETER_ARN}"
                        },
                    ]
                    # (5 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          + "CLOUDQUERY_API_KEY_SSM_PARAMETER_ARN" = (known after apply)
            # (6 unchanged elements hidden)
        }
    }

  # aws_cloudwatch_event_rule.cloudquery will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "cloudquery" {
        id                  = "cloudquery"
        name                = "cloudquery"
      ~ schedule_expression = "cron(0 22 * * ? *)" -> "cron(0 4 ? * MON *)"
        tags                = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.cloudquery will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "cloudquery" {
        id             = "cloudquery-cloudquery"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery:4" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_ecs_task_definition.cloudquery must be replaced
-/+ resource "aws_ecs_task_definition" "cloudquery" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "CQ_S3_BUCKET"
                          - value = "security-tools-794722365809-cloudquery-results"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cloudquery:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cloudquery"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cloudquery-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cloudquery"
                  - portMappings     = []
                  - secrets          = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "cloudquery" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_parameter.cloudquery_api_key will be created
  + resource "aws_ssm_parameter" "cloudquery_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/cloudquery/cloudquery_api_key"
      + tags           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cloudquery_s3_bucket.aws_s3_bucket.this,
  on .terraform/modules/cloudquery_s3_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cloudquery"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
